{"basics":{"name":"Guanyuan Peter Pan 潘冠源","label":"Undergraduate","image":"","email":"guanyuanpeterpan@gmail.com, panguanyuan@qq.com, panguanyuan@hdu.edu.cn","url":"https://guanyuanpeterpan.github.io/"},"work":[{"name":"Intelligent Information Processing Laboratory, Hangzhou Dianzi University","position":"Undergraduate Researcher","url":"http://iipl.net.cn/","startDate":"2023-12-04","endDate":""}],"education":[{"institution":"Hangzhou Dianzi University","location":"Zhejiang, Hangzhou, China","url":"https://joint.hdu.edu.cn/","area":"Computer Science","studyType":"Undergraduate","startDate":"2023-09-06","endDate":"2027-06-30"}],"awards":[{"title":"National Third Prize, Enterprise-Proposed Category of The 15th SOIEC (Students Service Outsourcing Innovation and Entrepreneurship Competition)","date":"2024","awarder":"Ministry of Education, P.R. China, Ministry of Commerce, P.R. China, et al.","url":"http://www.fwwb.org.cn/"},{"title":"Bronze Award, China International College Students' Innovation Competition 2024 (CICSIC) and Entrepreneurship Competition","date":"2024","awarder":"Ministry of Education, P.R. China et al.","url":"https://www.pilcchina.org/home"}],"publications":[{"name":"GNN-ACLP: Graph Neural Networks based Analog Circuit Link Prediction","publisher":"Guanyuan Pan, Tiansheng Zhou, Bingtao Ma, Yaqi Wang, Jianxiang Zhao, Zhi Li, Yugui Lin, Pietro Lio, Shuai Wang","releaseDate":"2025-04-14","url":"https://arxiv.org/abs/2504.10240","summary":"Circuit link prediction identifying missing component connections from incomplete netlists is crucial in analog circuit design automation. However, existing methods face three main challenges: 1) Insufficient use of topological patterns in circuit graphs reduces prediction accuracy; 2) Data scarcity due to the complexity of annotations hinders model generalization; 3) Limited adaptability to various netlist formats. We propose GNN-ACLP, a graph neural networks (GNNs) based method featuring three innovations to tackle these challenges. First, we introduce the SEAL (learning from Subgraphs, Embeddings, and Attributes for Link prediction) framework and achieve port-level accuracy in circuit link prediction. Second, we propose Netlist Babel Fish, a netlist format conversion tool leveraging retrieval-augmented generation (RAG) with a large language model (LLM) to improve the compatibility of netlist formats. Finally, we construct SpiceNetlist, a comprehensive dataset that contains 775 annotated circuits across 10 different component classes. Experiments demonstrate accuracy improvements of 16.08% on SpiceNetlist, 11.38% on Image2Net, and 16.01% on Masala-CHAI compared to the baseline in intra-dataset evaluation, while maintaining accuracy from 92.05% to 99.07% in cross-dataset evaluation, exhibiting robust feature transfer capabilities."}],"languages":[{"language":"Mandarin","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""},{"language":"Cantonese","fluency":"Good","icon":""}],"interests":[{"name":"Music","icon":"fa-solid fa-tag","keywords":["Piano"]}],"references":[{"name":"Professor Shuai Wang","icon":"fa-solid fa-laptop","reference":"E-mail: shuaiwang@hdu.edu.cn"}]}