{"basics":{"name":"Guanyuan Peter Pan 潘冠源","label":"Undergraduate","image":"","email":"guanyuanpeterpan@gmail.com, panguanyuan@qq.com, panguanyuan@hdu.edu.cn","url":"https://guanyuanpeterpan.github.io/"},"work":[{"name":"Intelligent Information Processing Laboratory, Hangzhou Dianzi University","position":"Undergraduate Researcher","url":"http://iipl.net.cn/","startDate":"2023-12-04","endDate":""}],"projects":[{"name":"Systematic Review Work Shop-Peer Support Group (SRWS-PSG) & SIGNATE SOTA Challenge: Automatic Classifying Medical Papers","summary":"Employ DeepSeek-R1-Distill-Qwen-14B/Phi-4-mini-instruct, LangChain, Faiss to build a LLM-RAG system to classify given medical papers based on given examples (no classifying rules were given).","highlights":["Document classification","Large Language Model","Plain RAG"],"startDate":"2024-12","endDate":"2025-04"},{"name":"The 19th 'Challenge Cup' National College Student Extracurricular Academic and Technological Works Competition (Provincial Prize)","summary":"Co-led a team of students to design and build a system for lithium-ion battery state monitoring and early fault warning. Serve as the spokesperson of the team.","highlights":["Time-Series Forecasting","Lithium-ion Battery Safety"],"startDate":"2024-12","endDate":"2025-04"},{"name":"Deep Learning Summer Programme, Girton College, University of Cambridge","summary":"Study Reinforcement Learning and Graph. Develop a medical image segmentation method employing ViG-UNet with multi-fusion dense skip connection with two other undergraduate.","highlights":["Reinforcement Learning","Graph"],"startDate":"2024-08","endDate":"2024-08"},{"name":"The 15th China Students Service Outsourcing Innovation and Entrepreneurship Competition (SOIEC) (National Third Prize, Enterprise-Proposed Category)","summary":"Co-work with three undergraduates and one graduates to build a tourism domain corpus dataset of Hangzhou, and employ it for an online tourism information Q&A service utilizing Qwen-1.8B-Chat, Bert-Chinese and DashVector.","highlights":["Data Collection","Data Cleaning","Small Language Model","Plain RAG"],"startDate":"2023-10","endDate":"2024-07"}],"awards":[{"title":"Honorable Mention, The Mathematical Contest in Modeling (MCM) and Interdisciplinary Contest in Modeling (ICM) 2025","date":"2025","awarder":"The Consortium for Mathematics and its Applications (COMAP)","url":"http://www.fwwb.org.cn/"},{"title":"National Third Prize, Enterprise-Proposed Category of The 15th SOIEC (Students Service Outsourcing Innovation and Entrepreneurship Competition)","date":"2024","awarder":"Ministry of Education, P.R. China, Ministry of Commerce, P.R. China et al.","url":"http://www.fwwb.org.cn/"}],"publications":[{"name":"GNN-ACLP: Graph Neural Networks based Analog Circuit Link Prediction","publisher":"Guanyuan Pan, Tiansheng Zhou, Bingtao Ma, Yaqi Wang, Jianxiang Zhao, Zhi Li, Yugui Lin, Pietro Lio, Shuai Wang","releaseDate":"2025-04-14","url":"https://arxiv.org/abs/2504.10240","summary":"Circuit link prediction identifying missing component connections from incomplete netlists is crucial in analog circuit design automation. However, existing methods face three main challenges: 1) Insufficient use of topological patterns in circuit graphs reduces prediction accuracy; 2) Data scarcity due to the complexity of annotations hinders model generalization; 3) Limited adaptability to various netlist formats. We propose GNN-ACLP, a graph neural networks (GNNs) based method featuring three innovations to tackle these challenges. First, we introduce the SEAL (learning from Subgraphs, Embeddings, and Attributes for Link prediction) framework and achieve port-level accuracy in circuit link prediction. Second, we propose Netlist Babel Fish, a netlist format conversion tool leveraging retrieval-augmented generation (RAG) with a large language model (LLM) to improve the compatibility of netlist formats. Finally, we construct SpiceNetlist, a comprehensive dataset that contains 775 annotated circuits across 10 different component classes. Experiments demonstrate accuracy improvements of 16.08% on SpiceNetlist, 11.38% on Image2Net, and 16.01% on Masala-CHAI compared to the baseline in intra-dataset evaluation, while maintaining accuracy from 92.05% to 99.07% in cross-dataset evaluation, exhibiting robust feature transfer capabilities."}],"education":[{"institution":"Hangzhou Dianzi University","location":"Hangzhou","url":"https://joint.hdu.edu.cn/","area":"Computer Science","studyType":"Undergraduate","startDate":"2023-09-06","endDate":"2027-06-30"}],"languages":[{"language":"Mandarin","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""},{"language":"Cantonese","fluency":"Good","icon":""}],"interests":[{"name":"Music","icon":"fa-solid fa-tag","keywords":["Piano"]}],"references":[{"name":"Professor Shuai Wang","icon":"fa-solid fa-laptop","reference":"Personal Page: https://faculty.hdu.edu.cn/wlkjaqxy/ws2/main.htm; E-mail: shuaiwang@hdu.edu.cn"}]}